NOTES.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>
* Notes on MaestroQA homework
** Introduction

Hello there! These notes are a sort of stream-of-conciousness of my thought
process as I tackled this problem.

I find that when it comes to take-home assignments capturing these sorts of
thoughts helps reviewers follow along with my thought process and helps clear up
any confusion in case there's a deviation from the assignment instructions or a
misunderstanding.

In essence, if I get something wrong I'm hoping for points for showing my work.

I also find that it helps me explore different branches of thought that might
wander outside of the boundaries of the assignment. Following refactoring ideas,
cleaning up prescribed interfaces for a neater implmentation, that sort of thing.

These notes were composed in Emacs, using =org-mode= and was exported to html
using @gongzhitaao's org-css project for styling. Github supports org markup, so
you should also be able to read it comfortably there. Or feel free to view the
html output in your favorite fashion

** Live thoughts
*** Okay, so, instructions
Reading through the instructions, we're given a pretty simple scenario. We have
a bunch of concurrent workers and a resource (an =output.txt= file) that might be
in contention between the workers.

We're given an in-memory database implementation (=mock_db.py=) with which we'll
implement a locking solution. Okay, cooperative database locking, I've done this
before. It can be a little fraught if you're not careful, but for a simple
homework problem it will be fine.

25 workers will write 'Maestro is the best......' to an output file some N <= 25
times.

The provided test makes sure that all the lines that are written are just the
above message printed in whole. The system as it exists produces garbled output:

#+BEGIN_SRC 
MaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestro
isro isro isro isro isro isro isro isro isro isro isro isro isro isro isro isro
isro isro isro isro isro isro isro is the the the the the the the the the the
the the the the the the the the the the the the the the
best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.........................................................................................................................

// newlines omitted
#+END_SRC

This does not pass the test as-is.

We'll be modifying =starter_code.py= to implement the locking mechanism.

*** First pass

As I think through this problem, I start thinking about semantics and API I want
the lock to have.

The lock should have an _id that is known to the other workers. In this instance
I went with a parameter called =key= that would essentially just be a lock name,
I went with the string ='worker'=, but it would work equally well with a
generated lock key that is shared amongst the workers. This allows for there to
be theoretically many locks.

The lock should have an idea of the current holder of the lock, and looking at
the current state of =starter_code.py= it seems that =worker_hash= is a
serviceable identifier.

Only the current holder of the lock should be able to unlock the lock, but any
worker should be able to see the status of the lock.

Finally, in all cases we always want the lock to be unlocked when the worker has
finished, successfully or no. This'll mean wrapping the worker up in a
=try...finally= that ensures the lock is unlocked on the way out.

You can see stubs of where I was in my thought process here by checking out the
tag =semantics-and-api=.

*** Filling in details

As the solution is taking shape in my mind, I begin to fill out the details of
each function and write some tests to make sure I'm implementing things
correctly as I go along.

**** Creating a lock in the database

First off, we'll set up a little =unittest= test case

#+BEGIN_SRC python
from starter_code import lock, unlock, lock_is_free
from mock_db import DB
from unittest import TestCase

import uuid

class LockTestCase(TestCase):
    def setUp(self):
        self.db = DB()
        self.worker_hash = uuid.uuid1()
        self.other_worker_hash = uuid.uuid1()
#+END_SRC

This gets us off to a good start, some simple test rigging.

Okay, the first test I want to write is that I want to make sure that we can
actually create a lock in the mock db

#+BEGIN_SRC python
def test_lock_can_create_a_new_lock(self):
    lock('worker', self.worker_hash, self.db)
    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertIsNotNone(new_lock)
#+END_SRC

This test currently fails, because the =lock= function doesn't yet have a body,
let's fix that.

#+BEGIN_SRC python
def lock(key, worker_hash, db):
    # ... snip docstring ...
    db.insert_one({ '_id': key })
#+END_SRC

This implementation is incomplete, but it passes the test as is. Let's move on.

