NOTES.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-09 Wed 09:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Raloff" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org02b00e7">1. Notes on MaestroQA homework</a>
<ul>
<li><a href="#org5033f7c">1.1. Introduction</a></li>
<li><a href="#org7f3ef6f">1.2. Live thoughts</a>
<ul>
<li><a href="#orgc397758">1.2.1. Okay, so, instructions</a></li>
<li><a href="#org9711b75">1.2.2. First pass</a></li>
<li><a href="#org17efa0f">1.2.3. Filling in details</a></li>
<li><a href="#orgf4709a7">1.2.4. Details: Filled</a></li>
<li><a href="#org177e1e6">1.2.5. The Atomic Pass</a></li>
<li><a href="#orgf77077f">1.2.6. Retry logic</a></li>
<li><a href="#org073a57a">1.2.7. Just one more thing&#x2026;</a></li>
<li><a href="#orgd7dd3d1">1.2.8. Conclusion</a></li>
</ul>
</li>
<li><a href="#org4008679">1.3. Git Key</a>
<ul>
<li><a href="#orgcfbc4b0">1.3.1. Branches</a></li>
<li><a href="#org00ebd7b">1.3.2. Tags</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org02b00e7" class="outline-2">
<h2 id="org02b00e7"><span class="section-number-2">1</span> Notes on MaestroQA homework</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5033f7c" class="outline-3">
<h3 id="org5033f7c"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Hello there! These notes are a sort of stream-of-conciousness of my thought
process as I tackled this problem.
</p>

<p>
I find that when it comes to take-home assignments capturing these sorts of
thoughts helps reviewers follow along with my thought process and helps clear up
any confusion in case there's a deviation from the assignment instructions or a
misunderstanding.
</p>

<p>
In essence, if I get something wrong I'm hoping for points for showing my work.
</p>

<p>
I also find that it helps me explore different branches of thought that might
wander outside of the boundaries of the assignment. Following refactoring ideas,
cleaning up prescribed interfaces for a neater implmentation, that sort of thing.
</p>

<p>
These notes were composed in Emacs, using <code>org-mode</code> and was exported to html
using @gongzhitaao's org-css project for styling. Github supports org markup, so
you should also be able to read it comfortably there. Or feel free to view the
html output in your favorite fashion
</p>
</div>
</div>

<div id="outline-container-org7f3ef6f" class="outline-3">
<h3 id="org7f3ef6f"><span class="section-number-3">1.2</span> Live thoughts</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc397758" class="outline-4">
<h4 id="orgc397758"><span class="section-number-4">1.2.1</span> Okay, so, instructions</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Reading through the instructions, we're given a pretty simple scenario. We have
a bunch of concurrent workers and a resource (an <code>output.txt</code> file) that might be
in contention between the workers.
</p>

<p>
We're given an in-memory database implementation (<code>mock_db.py</code>) with which we'll
implement a locking solution. Okay, cooperative database locking, I've done this
before. It can be a little fraught if you're not careful, but for a simple
homework problem it will be fine.
</p>

<p>
25 workers will write 'Maestro is the best&#x2026;&#x2026;' to an output file some N &lt;= 25
times.
</p>

<p>
The provided test makes sure that all the lines that are written are just the
above message printed in whole. The system as it exists produces garbled output:
</p>

<pre class="example">
MaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestMaestro
isro isro isro isro isro isro isro isro isro isro isro isro isro isro isro isro
isro isro isro isro isro isro isro is the the the the the the the the the the
the the the the the the the the the the the the the the
best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.best.........................................................................................................................

// newlines omitted
</pre>

<p>
This does not pass the test as-is.
</p>

<p>
We'll be modifying <code>starter_code.py</code> to implement the locking mechanism.
</p>
</div>
</div>

<div id="outline-container-org9711b75" class="outline-4">
<h4 id="org9711b75"><span class="section-number-4">1.2.2</span> First pass</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
As I think through this problem, I start thinking about semantics and API I want
the lock to have.
</p>

<p>
The lock should have an _id that is known to the other workers. In this instance
I went with a parameter called <code>key</code> that would essentially just be a lock name,
I went with the string <code>'worker'</code>, but it would work equally well with a
generated lock key that is shared amongst the workers. This allows for there to
be theoretically many locks.
</p>

<p>
The lock should have an idea of the current holder of the lock, and looking at
the current state of <code>starter_code.py</code> it seems that <code>worker_hash</code> is a
serviceable identifier.
</p>

<p>
Only the current holder of the lock should be able to unlock the lock, but any
worker should be able to see the status of the lock.
</p>

<p>
Finally, in all cases we always want the lock to be unlocked when the worker has
finished, successfully or no. This'll mean wrapping the worker up in a
<code>try...finally</code> that ensures the lock is unlocked on the way out.
</p>

<p>
You can see stubs of where I was in my thought process here by checking out the
tag <code>semantics-and-api</code>.
</p>
</div>
</div>

<div id="outline-container-org17efa0f" class="outline-4">
<h4 id="org17efa0f"><span class="section-number-4">1.2.3</span> Filling in details</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
As the solution is taking shape in my mind, I begin to fill out the details of
each function and write some tests to make sure I'm implementing things
correctly as I go along.
</p>
</div>

<ol class="org-ol">
<li><a id="orgf11361c"></a>Creating a lock in the database<br />
<div class="outline-text-5" id="text-1-2-3-1">
<p>
First off, we'll set up a little <code>unittest</code> test case
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">from</span> starter_code <span style="color: #00af00; font-weight: bold;">import</span> lock, unlock, lock_is_free
<span style="color: #00af00; font-weight: bold;">from</span> mock_db <span style="color: #00af00; font-weight: bold;">import</span> DB
<span style="color: #00af00; font-weight: bold;">from</span> unittest <span style="color: #00af00; font-weight: bold;">import</span> TestCase

<span style="color: #00af00; font-weight: bold;">import</span> uuid

<span style="color: #00af00; font-weight: bold;">class</span> <span style="color: #18b2b2; font-weight: bold;">LockTestCase</span>(TestCase):
    <span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">setUp</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
        <span style="color: #00af00; font-weight: bold;">self</span>.db = DB()
        <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash = uuid.uuid1()
        <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash = uuid.uuid1()
</pre>
</div>

<p>
This gets us off to a good start, some simple test rigging.
</p>

<p>
Okay, the first test I want to write is that I want to make sure that we can
actually create a lock in the mock db
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_can_create_a_new_lock</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertIsNotNone(new_lock)
</pre>
</div>

<p>
This test currently fails, because the <code>lock</code> function doesn't yet have a body,
let's fix that.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">lock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring ...</span>
    db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key })
</pre>
</div>

<p>
This implementation is incomplete, but it passes the test as is. Let's move on.
</p>
</div>
</li>
