NOTES.org
**** =lock= sets the =locked= field of the lock to =True=

The format we'll follow from here is to simply list the new test case, and then
some commentary to getting the test green.

#+BEGIN_SRC python
def test_lock_sets_the_locked_field_to_true(self):
    lock('worker', self.worker_hash, self.db)
    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertEqual(new_lock.get('locked', None), True)
#+END_SRC

This one is pretty simple, we simply include that attribute in the lock document:

#+BEGIN_SRC python
db.insert_one({ '_id': key, 'locked': True })
#+END_SRC

**** =lock= sets the =owner= field to match the given =worker_hash=
#+BEGIN_SRC python
def test_lock_sets_the_owner_field_to_match_the_worker_hash(self):
    lock('worker', self.worker_hash, self.db)
    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertEqual(new_lock.get('owner', None), self.worker_hash)
#+END_SRC

Again, simply add =worker_hash= to the document
#+BEGIN_SRC python
db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })
#+END_SRC

**** =lock= raises an error when a currently-locked lock is attempted to be locked by a different owner
#+BEGIN_SRC python
def test_lock_raises_when_already_locked_by_a_different_owner(self):
    lock('worker', self.worker_hash, self.db)
    with self.assertRaisesRegex(Exception, '^.* already locked!$'):
        lock('worker', self.other_worker_hash, self.db)

#+END_SRC

This fails because instead a DuplicateKeyError is raised. We must raise our own
error before we attempt to create the lock.

#+BEGIN_SRC python
def lock(key, worker_hash, db):
    # ... snip docstring
    lock = db.find_one({ '_id': key })

    if lock == None:
        db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })

    if lock['locked'] == True and lock['owner'] != worker_hash:
        raise Exception(f'{key} is already locked!')
#+END_SRC

**** =lock= updates an existing unlocked lock to read as locked and with a new owner
#+BEGIN_SRC python
def test_lock_updates_an_existing_unlocked_lock(self):
    lock('worker', self.worker_hash, self.db)
    self.db.update_one({ '_id': 'worker' }, { 'locked': False })

    lock('worker', self.other_worker_hash, self.db)

    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertEqual(new_lock['locked'], True)
    self.assertEqual(new_lock['owner'], self.other_worker_hash)
#+END_SRC

This test is a little more involved, basically we create a new lock and update
it manually to be unlocked.

Then we lock the ='worker'= lock again, this time specifying a new =owner=, and
ensure that the lock is updated correctly.

Again, the new code is fairly straightforward:

#+BEGIN_SRC python
def lock(key, worker_hash, db):
    # ... snip docstring
    lock = db.find_one({ '_id': key })

    if lock == None:
        return db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })

    if lock['locked'] == True and lock['owner'] != worker_hash:
        raise Exception(f'{key} is already locked!')

    db.update_one({ '_id': key }, { 'locked': True, 'owner': worker_hash })
#+END_SRC

This implementation is a bit simplistic. For example, it ignores the case where
the lock is already locked, but the owner is the same as the one currently
requesting the lock.

I chose here to let this be the case because the outcome is the same as the next
case. If, for example, we had performance concerns, or implemented lock
expiration based on a stored timestamp, we'd want to address that case directly.

**** =unlock= should update the locked field to False
#+BEGIN_SRC python
def test_unlock_sets_the_locked_field_to_false(self):
    lock('worker', self.worker_hash, self.db)
    unlock('worker', self.worker_hash, self.db)

    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertFalse(new_lock['locked'])
#+END_SRC

This is our first test for =unlock=, and the implementation is pretty simple here.

#+BEGIN_SRC python
def unlock(key, worker_hash, db):
    # ... snip docblock
    db.update_one({ '_id': key }, { 'locked': False })
#+END_SRC

