NOTES.html

<li><a id="org579688f"></a><code>lock</code> sets the <code>locked</code> field of the lock to <code>True</code><br />
<div class="outline-text-5" id="text-1-2-3-2">
<p>
The format we'll follow from here is to simply list the new test case, and then
some commentary to getting the test green.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_sets_the_locked_field_to_true</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertEqual(new_lock.get(<span style="color: #ff1f8b;">'locked'</span>, <span style="color: #1f5bff;">None</span>), <span style="color: #1f5bff;">True</span>)
</pre>
</div>

<p>
This one is pretty simple, we simply include that attribute in the lock document:
</p>

<div class="org-src-container">
<pre class="src src-python">db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span> })
</pre>
</div>
</div>
</li>

<li><a id="orgb8059fd"></a><code>lock</code> sets the <code>owner</code> field to match the given <code>worker_hash</code><br />
<div class="outline-text-5" id="text-1-2-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_sets_the_owner_field_to_match_the_worker_hash</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertEqual(new_lock.get(<span style="color: #ff1f8b;">'owner'</span>, <span style="color: #1f5bff;">None</span>), <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash)
</pre>
</div>

<p>
Again, simply add <code>worker_hash</code> to the document
</p>
<div class="org-src-container">
<pre class="src src-python">db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })
</pre>
</div>
</div>
</li>

<li><a id="org890b198"></a><code>lock</code> raises an error when a currently-locked lock is attempted to be locked by a different owner<br />
<div class="outline-text-5" id="text-1-2-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_raises_when_already_locked_by_a_different_owner</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #00af00; font-weight: bold;">with</span> <span style="color: #00af00; font-weight: bold;">self</span>.assertRaisesRegex(<span style="color: #18b2b2; font-weight: bold;">Exception</span>, <span style="color: #ff1f8b;">'^.* already locked!$'</span>):
        lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

</pre>
</div>

<p>
This fails because instead a DuplicateKeyError is raised. We must raise our own
error before we attempt to create the lock.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">lock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">lock</span> = db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: key })

    <span style="color: #00af00; font-weight: bold;">if</span> lock == <span style="color: #1f5bff;">None</span>:
        db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })

    <span style="color: #00af00; font-weight: bold;">if</span> lock[<span style="color: #ff1f8b;">'locked'</span>] == <span style="color: #1f5bff;">True</span> <span style="color: #00af00; font-weight: bold;">and</span> lock[<span style="color: #ff1f8b;">'owner'</span>] != worker_hash:
        <span style="color: #00af00; font-weight: bold;">raise</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span>(f<span style="color: #ff1f8b;">'{key} is already locked!'</span>)
</pre>
</div>
</div>
</li>

<li><a id="org02d00f6"></a><code>lock</code> updates an existing unlocked lock to read as locked and with a new owner<br />
<div class="outline-text-5" id="text-1-2-3-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_updates_an_existing_unlocked_lock</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #00af00; font-weight: bold;">self</span>.db.update_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> }, { <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">False</span> })

    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertEqual(new_lock[<span style="color: #ff1f8b;">'locked'</span>], <span style="color: #1f5bff;">True</span>)
    <span style="color: #00af00; font-weight: bold;">self</span>.assertEqual(new_lock[<span style="color: #ff1f8b;">'owner'</span>], <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash)
</pre>
</div>

<p>
This test is a little more involved, basically we create a new lock and update
it manually to be unlocked.
</p>

<p>
Then we lock the <code>'worker'</code> lock again, this time specifying a new <code>owner</code>, and
ensure that the lock is updated correctly.
</p>

<p>
Again, the new code is fairly straightforward:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">lock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">lock</span> = db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: key })

    <span style="color: #00af00; font-weight: bold;">if</span> lock == <span style="color: #1f5bff;">None</span>:
        <span style="color: #00af00; font-weight: bold;">return</span> db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })

    <span style="color: #00af00; font-weight: bold;">if</span> lock[<span style="color: #ff1f8b;">'locked'</span>] == <span style="color: #1f5bff;">True</span> <span style="color: #00af00; font-weight: bold;">and</span> lock[<span style="color: #ff1f8b;">'owner'</span>] != worker_hash:
        <span style="color: #00af00; font-weight: bold;">raise</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span>(f<span style="color: #ff1f8b;">'{key} is already locked!'</span>)

    db.update_one({ <span style="color: #ff1f8b;">'_id'</span>: key }, { <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })
</pre>
</div>

<p>
This implementation is a bit simplistic. For example, it ignores the case where
the lock is already locked, but the owner is the same as the one currently
requesting the lock.
</p>

<p>
I chose here to let this be the case because the outcome is the same as the next
case. If, for example, we had performance concerns, or implemented lock
expiration based on a stored timestamp, we'd want to address that case directly.
</p>
</div>
</li>

<li><a id="org83f939e"></a><code>unlock</code> should update the locked field to False<br />
<div class="outline-text-5" id="text-1-2-3-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_unlock_sets_the_locked_field_to_false</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    unlock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertFalse(new_lock[<span style="color: #ff1f8b;">'locked'</span>])
</pre>
</div>

<p>
This is our first test for <code>unlock</code>, and the implementation is pretty simple here.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">unlock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docblock</span>
    db.update_one({ <span style="color: #ff1f8b;">'_id'</span>: key }, { <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">False</span> })
</pre>
</div>
</div>
</li>
