NOTES.org
**** =unlock= should gracefully handle non-existent locks
#+BEGIN_SRC python
def test_unlock_handles_locks_that_do_not_exist(self):
    unlock('worker', self.worker_hash, self.db)

    new_lock = self.db.find_one({ '_id': 'worker' })
    self.assertIsNone(new_lock)
#+END_SRC

This test actually passes without any changes. I think that's fine, performance
isn't even really an issue since any change to the code would involve trying to
lookup the lock first, so it wouldn't save us a roundtrip.

**** =unlock= should raise if it is called by a worker that is not the owner
#+BEGIN_SRC python
def test_unlock_raises_if_locked_by_a_different_owner(self):
    lock('worker', self.worker_hash, self.db)
    with self.assertRaisesRegex(Exception, '^.* locked by a different owner!$'):
        unlock('worker', self.other_worker_hash, self.db)
#+END_SRC

Pretty simple implementation here. Since now we have to look up the lock anyway,
I went ahead and refactored the code to return early if the lookup comes back empty.

#+BEGIN_SRC python
def unlock(key, worker_hash, db):
    # ... snip docstring
    lock = db.find_one({ '_id': key })

    if lock == None:
        return

    if lock['owner'] != worker_hash:
        raise Exception(f'{key} locked by a different owner!')
    
    db.update_one({ '_id': key }, { 'locked': False })
#+END_SRC

**** =lock_is_free= returns true if lock does not exist
#+BEGIN_SRC python
def test_lock_is_free_handles_non_existent_lock(self):
    result = lock_is_free('worker', self.worker_hash, self.db)
    self.assertTrue(result)
#+END_SRC

This test acually requires no changes so far.

**** =lock_is_free= returns the status of the lock
This one takes two tests
#+BEGIN_SRC python
def test_lock_is_free_returns_true_if_lock_is_unlocked(self):
    lock('worker', self.worker_hash, self.db)
    unlock('worker', self.worker_hash, self.db)

    self.assertTrue(lock_is_free('worker', self.other_worker_hash, self.db))

def test_lock_is_free_returns_false_if_lock_is_locked(self):
    lock('worker', self.worker_hash, self.db)

    self.assertFalse(lock_is_free('worker', self.other_worker_hash, self.db))
#+END_SRC

And the changes necessary are pretty minimal. I include explicit handling of the
=None= case here to ensure the other test continues passing.

#+BEGIN_SRC python
def lock_is_free(key, worker_hash, db):
    # ... snip docstring
    lock = db.find_one({ '_id': key })
    return lock == None or not lock['locked']
#+END_SRC

*** Details: Filled

And with that last set of passing tests, the first round of implementation work
is already done. Feel free to checkout the tag =lock-tests= to get a sense of where we are.


Let's check and see by running the starter code....
#+BEGIN_SRC
(maestroqa_homework) $ python starter_code.py
Exception in thread Thread-8:
Traceback (most recent call last):
  File "starter_code.py", line 82, in attempt_run_worker
    lock('worker', worker_hash, db)
  File "starter_code.py", line 22, in lock
    return db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })
  File "/Users/danra/stuff/InterviewHandout/mock_db.py", line 128, in insert_one
    raise Exception("DuplicateKeyError")
Exception: DuplicateKeyError

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/usr/local/opt/python@3.8/Frameworks/Python.framework/Versions/3.8/lib/python3.8/threading.py", line 932, in _bootstrap_inner
    self.run()
  File "/usr/local/opt/python@3.8/Frameworks/Python.framework/Versions/3.8/lib/python3.8/threading.py", line 870, in run
    self._target(*self._args, **self._kwargs)
  File "starter_code.py", line 85, in attempt_run_worker
    unlock('worker', worker_hash, db)
  File "starter_code.py", line 49, in unlock
    raise Exception(f'{key} locked by a different owner!')
Exception: worker locked by a different owner!
// ... on and on for a few more screenfulls
#+END_SRC
Okay, that absolutely fails.

Something I had made an assumption about is that once the =lock=, =unlock=, or
=lock_is_free= functions started running, the rest would run atomically.

That assumption turned out to be incorrect, because of the call to =sleep= in
the =mock_db='s =insert_one= method. Calling =sleep= there allows for another
thread to take priority, so each thread sees that the the ='worker'= lock is
unlocked and attempts to lock it, resulting in a flood of exceptions.

We'll have to make another pass, and this time work a bit more atomically.

