NOTES.html

<li><a id="org74536b8"></a><code>unlock</code> should gracefully handle non-existent locks<br />
<div class="outline-text-5" id="text-1-2-3-7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_unlock_handles_locks_that_do_not_exist</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    unlock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

    <span style="color: #ff8700;">new_lock</span> = <span style="color: #00af00; font-weight: bold;">self</span>.db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: <span style="color: #ff1f8b;">'worker'</span> })
    <span style="color: #00af00; font-weight: bold;">self</span>.assertIsNone(new_lock)
</pre>
</div>

<p>
This test actually passes without any changes. I think that's fine, performance
isn't even really an issue since any change to the code would involve trying to
lookup the lock first, so it wouldn't save us a roundtrip.
</p>
</div>
</li>

<li><a id="orgd808795"></a><code>unlock</code> should raise if it is called by a worker that is not the owner<br />
<div class="outline-text-5" id="text-1-2-3-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_unlock_raises_if_locked_by_a_different_owner</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #00af00; font-weight: bold;">with</span> <span style="color: #00af00; font-weight: bold;">self</span>.assertRaisesRegex(<span style="color: #18b2b2; font-weight: bold;">Exception</span>, <span style="color: #ff1f8b;">'^.* locked by a different owner!$'</span>):
        unlock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
</pre>
</div>

<p>
Pretty simple implementation here. Since now we have to look up the lock anyway,
I went ahead and refactored the code to return early if the lookup comes back empty.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">unlock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">lock</span> = db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: key })

    <span style="color: #00af00; font-weight: bold;">if</span> lock == <span style="color: #1f5bff;">None</span>:
        <span style="color: #00af00; font-weight: bold;">return</span>

    <span style="color: #00af00; font-weight: bold;">if</span> lock[<span style="color: #ff1f8b;">'owner'</span>] != worker_hash:
        <span style="color: #00af00; font-weight: bold;">raise</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span>(f<span style="color: #ff1f8b;">'{key} locked by a different owner!'</span>)

    db.update_one({ <span style="color: #ff1f8b;">'_id'</span>: key }, { <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">False</span> })
</pre>
</div>
</div>
</li>

<li><a id="orgad4e4d5"></a><code>lock_is_free</code> returns true if lock does not exist<br />
<div class="outline-text-5" id="text-1-2-3-9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_is_free_handles_non_existent_lock</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    <span style="color: #ff8700;">result</span> = lock_is_free(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    <span style="color: #00af00; font-weight: bold;">self</span>.assertTrue(result)
</pre>
</div>

<p>
This test acually requires no changes so far.
</p>
</div>
</li>

<li><a id="org900126a"></a><code>lock_is_free</code> returns the status of the lock<br />
<div class="outline-text-5" id="text-1-2-3-10">
<p>
This one takes two tests
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_is_free_returns_true_if_lock_is_unlocked</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)
    unlock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

    <span style="color: #00af00; font-weight: bold;">self</span>.assertTrue(lock_is_free(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db))

<span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">test_lock_is_free_returns_false_if_lock_is_locked</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    lock(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db)

    <span style="color: #00af00; font-weight: bold;">self</span>.assertFalse(lock_is_free(<span style="color: #ff1f8b;">'worker'</span>, <span style="color: #00af00; font-weight: bold;">self</span>.other_worker_hash, <span style="color: #00af00; font-weight: bold;">self</span>.db))
</pre>
</div>

<p>
And the changes necessary are pretty minimal. I include explicit handling of the
<code>None</code> case here to ensure the other test continues passing.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">lock_is_free</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">lock</span> = db.find_one({ <span style="color: #ff1f8b;">'_id'</span>: key })
    <span style="color: #00af00; font-weight: bold;">return</span> lock == <span style="color: #1f5bff;">None</span> <span style="color: #00af00; font-weight: bold;">or</span> <span style="color: #00af00; font-weight: bold;">not</span> lock[<span style="color: #ff1f8b;">'locked'</span>]
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf4709a7" class="outline-4">
<h4 id="orgf4709a7"><span class="section-number-4">1.2.4</span> Details: Filled</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
And with that last set of passing tests, the first round of implementation work
is already done. Feel free to checkout the tag <code>lock-tests</code> to get a sense of where we are.
</p>


<p>
Let's check and see by running the starter code&#x2026;.
</p>
<pre class="example">
(maestroqa_homework) $ python starter_code.py
Exception in thread Thread-8:
Traceback (most recent call last):
  File "starter_code.py", line 82, in attempt_run_worker
    lock('worker', worker_hash, db)
  File "starter_code.py", line 22, in lock
    return db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })
  File "/Users/danra/stuff/InterviewHandout/mock_db.py", line 128, in insert_one
    raise Exception("DuplicateKeyError")
Exception: DuplicateKeyError

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "/usr/local/opt/python@3.8/Frameworks/Python.framework/Versions/3.8/lib/python3.8/threading.py", line 932, in _bootstrap_inner
    self.run()
  File "/usr/local/opt/python@3.8/Frameworks/Python.framework/Versions/3.8/lib/python3.8/threading.py", line 870, in run
    self._target(*self._args, **self._kwargs)
  File "starter_code.py", line 85, in attempt_run_worker
    unlock('worker', worker_hash, db)
  File "starter_code.py", line 49, in unlock
    raise Exception(f'{key} locked by a different owner!')
Exception: worker locked by a different owner!
// ... on and on for a few more screenfulls
</pre>
<p>
Okay, that absolutely fails.
</p>

<p>
Something I had made an assumption about is that once the <code>lock</code>, <code>unlock</code>, or
<code>lock_is_free</code> functions started running, the rest would run atomically.
</p>

<p>
That assumption turned out to be incorrect, because of the call to <code>sleep</code> in
the <code>mock_db</code>'s <code>insert_one</code> method. Calling <code>sleep</code> there allows for another
thread to take priority, so each thread sees that the the <code>'worker'</code> lock is
unlocked and attempts to lock it, resulting in a flood of exceptions.
</p>

<p>
We'll have to make another pass, and this time work a bit more atomically.
</p>
</div>
</div>
