NOTES.org
*** The Atomic Pass

So, because retrieving and then updating the lock can't be counted on, we'll
have to just eagerly attempt to insert the lock, and if that fails attempt to
update the lock, and if that fails, raise an exception.

#+BEGIN_SRC python
def lock(key, worker_hash, db):
    # ... snip docstring
    try:
        db.insert_one({ '_id': key, 'locked': True, 'owner': worker_hash })
        return True
    except Exception:
        match = db.update_one({ '_id': key, 'locked': False }, { 'locked': True, 'owner': worker_hash })
        return match
#+END_SRC

So, the contract has changed a bit here. Now, instead of raising an exception,
=lock= simply returns =False= if the lock could not be acquired.

We also remove the relevant tests that looked for raised exceptions.

In addition, we found a small bug in =attempt_run_worker= where we attempt to
acquire the lock in a =try= block and then =unlock= in the =finally=, but
because that lock may not exist or be owned by a different worker at the time,
we have to shuffle the structure a bit.

#+BEGIN_SRC python
if lock_is_free('worker', worker_hash, db) and lock('worker', worker_hash, db):
    try:
        worker_main(worker_hash, db)
    finally:
        unlock('worker', worker_hash, db)
#+END_SRC

Okay, now when we run this, we get exactly one line of output 'Maestro is the
best......'.

That makes sense, because only one worker can acquire the lock, the rest die
immediately. You can see all our progress so far by checking out the tag =atomic-pass=

Let's fill in the last bit now: retry logic.

*** Retry logic

Now, compared to the rest, this bit is a bit simpler. Given values for
=give_up_after= and =retry_interval=, we poll the db in a =while= loop waiting
for the lock to become available.

#+BEGIN_SRC python
def attempt_run_worker(worker_hash, give_up_after, db, retry_interval):
    # ... snip docstring
    total_wait_time = 0
    while total_wait_time < give_up_after:
        if not (lock_is_free('worker', worker_hash, db) and lock('worker', worker_hash, db)):
            total_wait_time = total_wait_time + retry_interval
            sleep(retry_interval)
            continue

        try:
            worker_main(worker_hash, db)
            break
        except Exception as e:
            print(f'{worker_hash} encountered error: {e}')
        finally:
            unlock('worker', worker_hash, db)
    if total_wait_time >= give_up_after:
        print(f'{worker_hash} gave up after {total_wait_time}')

#+END_SRC

Pretty simply, as long as we can't acquire the lock, sleep for =retry_interval=
until we pass =give_up_after=.

If we finally acquire the lock, start the worker, and break out of the loop,
making sure to =unlock= on the way out.

Now, testing this version, we finally get a successful run. Check out the
=final-version= tag (or simply =HEAD= of the =master= branch) to see this
final version.

