NOTES.html

<div id="outline-container-org177e1e6" class="outline-4">
<h4 id="org177e1e6"><span class="section-number-4">1.2.5</span> The Atomic Pass</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
So, because retrieving and then updating the lock can't be counted on, we'll
have to just eagerly attempt to insert the lock, and if that fails attempt to
update the lock, and if that fails, raise an exception.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">lock</span>(key, worker_hash, db):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #00af00; font-weight: bold;">try</span>:
        db.insert_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })
        <span style="color: #00af00; font-weight: bold;">return</span> <span style="color: #1f5bff;">True</span>
    <span style="color: #00af00; font-weight: bold;">except</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span>:
        <span style="color: #ff8700;">match</span> = db.update_one({ <span style="color: #ff1f8b;">'_id'</span>: key, <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">False</span> }, { <span style="color: #ff1f8b;">'locked'</span>: <span style="color: #1f5bff;">True</span>, <span style="color: #ff1f8b;">'owner'</span>: worker_hash })
        <span style="color: #00af00; font-weight: bold;">return</span> match
</pre>
</div>

<p>
So, the contract has changed a bit here. Now, instead of raising an exception,
<code>lock</code> simply returns <code>False</code> if the lock could not be acquired.
</p>

<p>
We also remove the relevant tests that looked for raised exceptions.
</p>

<p>
In addition, we found a small bug in <code>attempt_run_worker</code> where we attempt to
acquire the lock in a <code>try</code> block and then <code>unlock</code> in the <code>finally</code>, but
because that lock may not exist or be owned by a different worker at the time,
we have to shuffle the structure a bit.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">if</span> lock_is_free(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db) <span style="color: #00af00; font-weight: bold;">and</span> lock(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db):
    <span style="color: #00af00; font-weight: bold;">try</span>:
        worker_main(worker_hash, db)
    <span style="color: #00af00; font-weight: bold;">finally</span>:
        unlock(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db)
</pre>
</div>

<p>
Okay, now when we run this, we get exactly one line of output 'Maestro is the
best&#x2026;&#x2026;'.
</p>

<p>
That makes sense, because only one worker can acquire the lock, the rest die
immediately. You can see all our progress so far by checking out the tag <code>atomic-pass</code>
</p>

<p>
Let's fill in the last bit now: retry logic.
</p>
</div>
</div>

<div id="outline-container-orgf77077f" class="outline-4">
<h4 id="orgf77077f"><span class="section-number-4">1.2.6</span> Retry logic</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Now, compared to the rest, this bit is a bit simpler. Given values for
<code>give_up_after</code> and <code>retry_interval</code>, we poll the db in a <code>while</code> loop waiting
for the lock to become available.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">attempt_run_worker</span>(worker_hash, give_up_after, db, retry_interval):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">total_wait_time</span> = 0
    <span style="color: #00af00; font-weight: bold;">while</span> total_wait_time &lt; give_up_after:
        <span style="color: #00af00; font-weight: bold;">if</span> <span style="color: #00af00; font-weight: bold;">not</span> (lock_is_free(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db) <span style="color: #00af00; font-weight: bold;">and</span> lock(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db)):
            <span style="color: #ff8700;">total_wait_time</span> = total_wait_time + retry_interval
            sleep(retry_interval)
            <span style="color: #00af00; font-weight: bold;">continue</span>

        <span style="color: #00af00; font-weight: bold;">try</span>:
            worker_main(worker_hash, db)
            <span style="color: #00af00; font-weight: bold;">break</span>
        <span style="color: #00af00; font-weight: bold;">except</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span> <span style="color: #00af00; font-weight: bold;">as</span> e:
            <span style="color: #00af00; font-weight: bold;">print</span>(f<span style="color: #ff1f8b;">'{worker_hash} encountered error: {e}'</span>)
        <span style="color: #00af00; font-weight: bold;">finally</span>:
            unlock(<span style="color: #ff1f8b;">'worker'</span>, worker_hash, db)
    <span style="color: #00af00; font-weight: bold;">if</span> total_wait_time &gt;= give_up_after:
        <span style="color: #00af00; font-weight: bold;">print</span>(f<span style="color: #ff1f8b;">'{worker_hash} gave up after {total_wait_time}'</span>)

</pre>
</div>

<p>
Pretty simply, as long as we can't acquire the lock, sleep for <code>retry_interval</code>
until we pass <code>give_up_after</code>.
</p>

<p>
If we finally acquire the lock, start the worker, and break out of the loop,
making sure to <code>unlock</code> on the way out.
</p>

<p>
Now, testing this version, we finally get a successful run. Check out the
<code>final-version</code> tag (or simply <code>HEAD</code> of the <code>master</code> branch) to see this
final version.
</p>
</div>
</div>
