NOTES.org
*** Just one more thing...

So, we finally have a working version of our locking logic. But it's not so fun
to use.

If you look at =attempt_run_worker= there's so many details about getting a lock
and waiting for the lock to become available that it should simply not be
responsible for.

Look at how nearly all of these lock-releated functions all take a =key= a
=worker_hash= and a =db= instance.

I think we can clean all of this up with a context handler. However, that
involves moving around some functions into a different class, which I wasn't
sure was kosher to the letter of the assignment. So, I've included this work in
a different branch: =contextmanager-locking=.

It's a simple refactor so I'll avoid getting too in-depth here. Mostly we create
a =Lock= class and move =lock=, =unlock= and =lock_is_free= into it, renaming
the latter to simply =is_free=.

Then, we move the lock acquisition logic into a new method =try_obtain_lock=. We
shuffle around the implementation a bit to make it easier to return whether the
lock could be acquired on time.

#+BEGIN_SRC python
def try_obtain_lock(self):
    """
    Try to obtain the lock, retrying every self.retry_interval seconds up to
    self.timeout seconds

    Returns: 
        True - if the lock was obtained
        False - if we timed out before we could acquire the lock
    """
    wait_time = 0
    lock_result = False
    while not lock_result and wait_time < self.timeout:
        lock_result = self.lock_is_free() and self.lock()
        if not lock_result:
            break
        wait_time = wait_time + self.retry_interval
        sleep(self.retry_interval)

    return lock_result
#+END_SRC


Then, we define =__enter__= and =__exit__= methods to support using instances as context managers:

#+BEGIN_SRC python
def __enter__(self):
    if not self.try_obtain_lock()
        raise Exception('Timed out waiting for a lock')

def __exit__(self, *args):
    self.unlock()
#+END_SRC

As I went along I kept the tests in-sync with the new implementation to ensure everything would work correctly.

Now =attempt_run_worker= looks like:

#+BEGIN_SRC python
def attempt_run_worker(worker_hash, give_up_after, db, retry_interval):
    # ... snip docstring
    lock = Lock(db=db, key='worker', owner=worker_hash, timeout=give_up_after, retry_interval=retry_interval)

    try:
        with lock:
            try:
                worker_main(worker_hash, db)
            except Exception as e:
                print(f'{worker_hash} encountered error: {e}')
    except Exception as e:
        print(f'{worker_hash} gave up waiting after {give_up_after}')

#+END_SRC

I feel like we've reached the limits of what we can do for this assignment.

*** Conclusion

So, just as I initialy thought, it takes some care to ensure that
database-maintained locks are implemented correctly. The naive solution to read
in the lock state and make decisions based on that simply allows too much for
other concurrent processes to grab the lock before we can.

So, we must let the decision of whether we can take the lock happen as close to
where the lock is stored as possible to avoid network delays, in this case, the
database. Real databases also have the advantage of implementing transactional
locking for us, so it makes sense to lean on that as much as we can.

At the end of it, we have a working implementation, unit tests to guarantee some
of the key functions, and (depending on what branch you look at) also a helpful
context manager to lessen the semantic load while reading through the code.

Looking forward to hearing back from you, I really enjoyed this assignment!

** Git Key
*** Branches
- =master= - the main assignment branch, and the branch most of the tags point to.
- =contextmanager-locking= - an alternative branch that goes outside of the strict
  letter of the assignment to explore implementing locking as a contextmanager
  implementation
*** Tags
- =semantics-and-api= - an initial pass filling in function stubs and a version
  of =attempt_run_worker= that simply tries to acquire the lock once

- =lock-tests= - the result of a TDD approach to filling in the stubs from
  =semantics-and-api=. Ultimately failing due to non-atomic lock acquisition

- =atomic-pass= - a small refactor of the =lock= function to make it acquire
  locks atomically

- =final-version= - the final version of the mainline assignment, implementing
  multiple attempts at lock acquisition in =attempt_run_worker=
