NOTES.html

<div id="outline-container-org073a57a" class="outline-4">
<h4 id="org073a57a"><span class="section-number-4">1.2.7</span> Just one more thing&#x2026;</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
So, we finally have a working version of our locking logic. But it's not so fun
to use.
</p>

<p>
If you look at <code>attempt_run_worker</code> there's so many details about getting a lock
and waiting for the lock to become available that it should simply not be
responsible for.
</p>

<p>
Look at how nearly all of these lock-releated functions all take a <code>key</code> a
<code>worker_hash</code> and a <code>db</code> instance.
</p>

<p>
I think we can clean all of this up with a context handler. However, that
involves moving around some functions into a different class, which I wasn't
sure was kosher to the letter of the assignment. So, I've included this work in
a different branch: <code>contextmanager-locking</code>.
</p>

<p>
It's a simple refactor so I'll avoid getting too in-depth here. Mostly we create
a <code>Lock</code> class and move <code>lock</code>, <code>unlock</code> and <code>lock_is_free</code> into it, renaming
the latter to simply <code>is_free</code>.
</p>

<p>
Then, we move the lock acquisition logic into a new method <code>try_obtain_lock</code>. We
shuffle around the implementation a bit to make it easier to return whether the
lock could be acquired on time.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">try_obtain_lock</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    <span style="color: #cc0000; font-style: italic;">"""</span>
<span style="color: #cc0000; font-style: italic;">    Try to obtain the lock, retrying every self.retry_interval seconds up to</span>
<span style="color: #cc0000; font-style: italic;">    self.timeout seconds</span>

<span style="color: #cc0000; font-style: italic;">    Returns: </span>
<span style="color: #cc0000; font-style: italic;">        True - if the lock was obtained</span>
<span style="color: #cc0000; font-style: italic;">        False - if we timed out before we could acquire the lock</span>
<span style="color: #cc0000; font-style: italic;">    """</span>
    <span style="color: #ff8700;">wait_time</span> = 0
    <span style="color: #ff8700;">lock_result</span> = <span style="color: #1f5bff;">False</span>
    <span style="color: #00af00; font-weight: bold;">while</span> <span style="color: #00af00; font-weight: bold;">not</span> lock_result <span style="color: #00af00; font-weight: bold;">and</span> wait_time &lt; <span style="color: #00af00; font-weight: bold;">self</span>.timeout:
        <span style="color: #ff8700;">lock_result</span> = <span style="color: #00af00; font-weight: bold;">self</span>.lock_is_free() <span style="color: #00af00; font-weight: bold;">and</span> <span style="color: #00af00; font-weight: bold;">self</span>.lock()
        <span style="color: #00af00; font-weight: bold;">if</span> <span style="color: #00af00; font-weight: bold;">not</span> lock_result:
            <span style="color: #00af00; font-weight: bold;">break</span>
        <span style="color: #ff8700;">wait_time</span> = wait_time + <span style="color: #00af00; font-weight: bold;">self</span>.retry_interval
        sleep(<span style="color: #00af00; font-weight: bold;">self</span>.retry_interval)

    <span style="color: #00af00; font-weight: bold;">return</span> lock_result
</pre>
</div>


<p>
Then, we define <code>__enter__</code> and <code>__exit__</code> methods to support using instances as context managers:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">__enter__</span>(<span style="color: #00af00; font-weight: bold;">self</span>):
    <span style="color: #00af00; font-weight: bold;">if</span> <span style="color: #00af00; font-weight: bold;">not</span> <span style="color: #00af00; font-weight: bold;">self</span>.try_obtain_lock()
        <span style="color: #00af00; font-weight: bold;">raise</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span>(<span style="color: #ff1f8b;">'Timed out waiting for a lock'</span>)

<span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">__exit__</span>(<span style="color: #00af00; font-weight: bold;">self</span>, *args):
    <span style="color: #00af00; font-weight: bold;">self</span>.unlock()
</pre>
</div>

<p>
As I went along I kept the tests in-sync with the new implementation to ensure everything would work correctly.
</p>

<p>
Now <code>attempt_run_worker</code> looks like:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00af00; font-weight: bold;">def</span> <span style="color: #ef2929;">attempt_run_worker</span>(worker_hash, give_up_after, db, retry_interval):
    <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #b2b2b2; font-style: italic;">... snip docstring</span>
    <span style="color: #ff8700;">lock</span> = Lock(db=db, key=<span style="color: #ff1f8b;">'worker'</span>, owner=worker_hash, timeout=give_up_after, retry_interval=retry_interval)

    <span style="color: #00af00; font-weight: bold;">try</span>:
        <span style="color: #00af00; font-weight: bold;">with</span> lock:
            <span style="color: #00af00; font-weight: bold;">try</span>:
                worker_main(worker_hash, db)
            <span style="color: #00af00; font-weight: bold;">except</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span> <span style="color: #00af00; font-weight: bold;">as</span> e:
                <span style="color: #00af00; font-weight: bold;">print</span>(f<span style="color: #ff1f8b;">'{worker_hash} encountered error: {e}'</span>)
    <span style="color: #00af00; font-weight: bold;">except</span> <span style="color: #18b2b2; font-weight: bold;">Exception</span> <span style="color: #00af00; font-weight: bold;">as</span> e:
        <span style="color: #00af00; font-weight: bold;">print</span>(f<span style="color: #ff1f8b;">'{worker_hash} gave up waiting after {give_up_after}'</span>)

</pre>
</div>

<p>
I feel like we've reached the limits of what we can do for this assignment.
</p>
</div>
</div>

<div id="outline-container-orgd7dd3d1" class="outline-4">
<h4 id="orgd7dd3d1"><span class="section-number-4">1.2.8</span> Conclusion</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
So, just as I initialy thought, it takes some care to ensure that
database-maintained locks are implemented correctly. The naive solution to read
in the lock state and make decisions based on that simply allows too much for
other concurrent processes to grab the lock before we can.
</p>

<p>
So, we must let the decision of whether we can take the lock happen as close to
where the lock is stored as possible to avoid network delays, in this case, the
database. Real databases also have the advantage of implementing transactional
locking for us, so it makes sense to lean on that as much as we can.
</p>

<p>
At the end of it, we have a working implementation, unit tests to guarantee some
of the key functions, and (depending on what branch you look at) also a helpful
context manager to lessen the semantic load while reading through the code.
</p>

<p>
Looking forward to hearing back from you, I really enjoyed this assignment!
</p>
</div>
</div>
</div>

<div id="outline-container-org4008679" class="outline-3">
<h3 id="org4008679"><span class="section-number-3">1.3</span> Git Key</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgcfbc4b0" class="outline-4">
<h4 id="orgcfbc4b0"><span class="section-number-4">1.3.1</span> Branches</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><code>master</code> - the main assignment branch, and the branch most of the tags point to.</li>
<li><code>contextmanager-locking</code> - an alternative branch that goes outside of the strict
letter of the assignment to explore implementing locking as a contextmanager
implementation</li>
</ul>
</div>
</div>
<div id="outline-container-org00ebd7b" class="outline-4">
<h4 id="org00ebd7b"><span class="section-number-4">1.3.2</span> Tags</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><code>semantics-and-api</code> - an initial pass filling in function stubs and a version
of <code>attempt_run_worker</code> that simply tries to acquire the lock once</li>

<li><code>lock-tests</code> - the result of a TDD approach to filling in the stubs from
<code>semantics-and-api</code>. Ultimately failing due to non-atomic lock acquisition</li>

<li><code>atomic-pass</code> - a small refactor of the <code>lock</code> function to make it acquire
locks atomically</li>

<li><code>final-version</code> - the final version of the mainline assignment, implementing
multiple attempts at lock acquisition in <code>attempt_run_worker</code></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Raloff</p>
<p class="date">Created: 2020-09-09 Wed 09:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
